#include "0386.h"
/*============================================================================*/
/* global */
/*============================================================================*/

/*============================================================================*/
/* const */
/*============================================================================*/

/*============================================================================*/
/* prototype */
/*============================================================================*/
int main()
{
	struct Star star[STAR_NUM];
    int test[STAR_NUM];
    int count;
    char entranceChar[STAR_NUM];
    char exitChar[STAR_NUM];
    scanf("%d", &count);
    scanf("%s\n", &entranceChar);
    scanf("%s", &exitChar);
    for(int i = 0; i < count; i++){
        star[i].num = i + 1;
        star[i].entrance = entranceChar[i];
        star[i].exit = exitChar[i];
    }

    // アルゴリズムを思いつかないため、保留
	return 0;
}
